     A* Redistribution and use in source and binary forms, with or without
     A* modification, are permitted provided that the following conditions are
     A* met:
     A*
     A* 1. Redistributions of source code must retain the above copyright
     A*    notice, this list of conditions and the following disclaimer.
     A* 2. Redistributions in binary form must reproduce the above copyright
     A*    notice, this list of conditions and the following disclaimer in the
     A*    documentation  and/or other materials provided with the distribution.
     A*
     A* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS
     A* IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
     A* TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
     A* PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
     A* OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
     A* SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
     A* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
     A* DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
     A* THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
     A* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
     A* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
     A*
     A* Globals ----------------------------------------------------------------
     A                                      UNIQUE
     A* Record Format Name -----------------------------------------------------
     A          R COMPREFS
     A* Data fields
     A            DESCR         80A
     A            VALUE         24A
     A            SETTING        8A
     A* Index field(s)
     A          K SETTING
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
