     A* Licensing terms.
     A* This is free software; you can redistribute it and/or
     A* modify it under the terms of the GNU General Public License as published
     A* by the Free Software Foundation; either version 3 of the License, or
     A* (at your option) any later version.
     A*
     A* It is distributed in the hope that it will be useful,
     A* but WITHOUT ANY WARRANTY; without even the implied warranty of
     A* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
     A* GNU General Public License for more details.
     A*
     A* You should have received a copy of the GNU General Public License
     A* along with this; if not, write to the Free Software
     A* Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
     A* or get it at http://www.gnu.org/licenses/gpl.html
     A*
     A* Globals ----------------------------------------------------------------
     A                                      UNIQUE
     A* Record Format Name -----------------------------------------------------
     A          R COMPORTTBL
     A* Data fields
     A            DESCR         16A
     A            PORT           2S 0
     A            INOUT          1A         VALUES('I' 'O') DFT('I')
     A            TICKS          1S 0       TEXT('Pulses per Wh')
     A            CUR_STAT       1A
     A* Index field(s)
     A          K INOUT
     A          K PORT
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
